       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR.  AMN.	   
       PROCEDURE DIVISION.
           DISPLAY "Hello world I DID IT".
            STOP RUN.
       END PROGRAM HELLO.