       IDENTIFICATION DIVISION.
       PROGRAM-ID.  KILOMETRIQUECOMPTEUR.
       AUTHOR.  AMN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COMPTEURS.
           02 HUNDREDSCOUNT          PIC 99.
           02 TENSCOUNT              PIC 99.
           02 UNITSCOUNT             PIC 99.

       01 DISPLAYITEMS.
           02 PRNHUNDS               PIC 9.
           02 PRNTENS                PIC 9.
           02 PRNUNITS               PIC 9.

       PROCEDURE DIVISION.
       BEGIN.
          DISPLAY "UTILISANT AN OUT-OF-LINE PERFORM".
          DISPLAY "SUR LE POINT DE COMMENCER COMPTEUR
          KILOMETRIQUE SIMULATION".
          PERFORM COUNTKM
             VARYING HUNDREDSCOUNT FROM 0 BY 1 UNTIL HUNDREDSCOUNT > 9
             AFTER   TENSCOUNT FROM 0 BY 1 UNTIL TENSCOUNT > 9
             AFTER   UNITSCOUNT FROM 0 BY 1 UNTIL UNITSCOUNT > 9
          DISPLAY "FIN DE COMPTEUR KILOMETRIQUE SIMULATION."

          DISPLAY "NOW UTILISANT IN-LINE PERFORMS"
          DISPLAY "ABOUT TO COMMENCER COMPTEUR KILOMETRIQUE SIMULATION".
       PERFORM VARYING HUNDREDSCOUNT FROM 0 BY 1 UNTIL HUNDREDSCOUNT > 9
       PERFORM VARYING TENSCOUNT FROM 0 BY 1 UNTIL TENSCOUNT > 9
       PERFORM VARYING UNITSCOUNT FROM 0 BY 1 UNTIL UNITSCOUNT > 9
                  MOVE HUNDREDSCOUNT TO PRNHUNDS
                  MOVE TENSCOUNT     TO  PRNTENS
                  MOVE UNITSCOUNT    TO PRNUNITS
                  DISPLAY PRNHUNDS "-" PRNTENS "-" PRNUNITS
               END-PERFORM
            END-PERFORM
          END-PERFORM.
          DISPLAY "FIN DE COMPTEUR KILOMETRIQUE SIMULATION."
          STOP RUN.


       COUNTKM.
          MOVE HUNDREDSCOUNT TO PRNHUNDS
          MOVE TENSCOUNT     TO  PRNTENS
          MOVE UNITSCOUNT    TO PRNUNITS
          DISPLAY PRNHUNDS "-" PRNTENS "-" PRNUNITS.
