	   IDENTIFICATION DIVISION.
       PROGRAM-ID.  PERFORMFORMAT4.
       AUTHOR.  AMN.       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  LOOPCOUNT          PIC 9  VALUE ZEROS.
       01  LOOPCOUNT2         PIC S9 VALUE ZEROS.
       
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "COMMENCER WHILE ITERATION DE LOOPBODY"
           PERFORM LOOPBODY WITH TEST BEFORE
               VARYING LOOPCOUNT FROM 1 BY 2
               UNTIL LOOPCOUNT GREATER THAN 5.
           DISPLAY "FIN WHILE ITERATION.  LOOPCOUNT = " LOOPCOUNT.
       
           DISPLAY "COMMENCER REPETITION ITERATION DE LOOPBODY"
           PERFORM LOOPBODY WITH TEST AFTER
               VARYING LOOPCOUNT FROM 1 BY 2 
               UNTIL LOOPCOUNT GREATER THAN 5.
           DISPLAY "FIN REPETITION ITERATION. LOOPCOUNT = " LOOPCOUNT.
       
           DISPLAY "COMMENCER INLINE LOOPS"
           PERFORM VARYING LOOPCOUNT FROM 1 BY 1 
                           UNTIL LOOPCOUNT GREATER THAN 4
              PERFORM VARYING LOOPCOUNT2 FROM 5 BY -2 
                              UNTIL LOOPCOUNT2 LESS THAN ZERO
                 DISPLAY "INLINE LOOP " WITH NO ADVANCING
                 DISPLAY "LOOPCOUNT = " LOOPCOUNT " LOOPCOUNT2 = " 
                 LOOPCOUNT2
              END-PERFORM
           END-PERFORM.
           DISPLAY "FIN INLINE LOOPS".
           
           DISPLAY "COMMENCER PERFORM VARYING..AFTER".
           PERFORM LOOPBODY VARYING LOOPCOUNT FROM 1 BY 1
                              UNTIL LOOPCOUNT GREATER THAN 4
                        AFTER LOOPCOUNT2 FROM 5 BY -2
                              UNTIL LOOPCOUNT2 LESS THAN ZERO.
           DISPLAY "FIN PERFORM VARYING..AFTER".
           STOP RUN.
       
       
       LOOPBODY.
           DISPLAY "LOOPBODY " WITH NO ADVANCING
           DISPLAY "LOOPCOUNT = " LOOPCOUNT " LOOPCOUNT2 = " LOOPCOUNT2.
       