       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PERFORMFORMAT1.
       AUTHOR.  AMN.	   
       PROCEDURE DIVISION.
       TOPNIVEAU.
           DISPLAY "--> TOPNIVEAU. ON ON VIENT DE COMMENCER"
           PERFORM PREMIERNIVEAUDOWN
           DISPLAY "RETOUR --> TOPNIVEAU.".
           STOP RUN.

       DEUXIEMENIVEAUSDOWN.
           DISPLAY ">>>>>>>> NOUS SOMMES DEUXIEMENIVEAUSDOWN."
           PERFORM TROISIEMENIVEAUSDOWN.
           DISPLAY ">>>>>>>> RETOUR --> DEUXIEMENIVEAUSDOWN.".

       PREMIERNIVEAUDOWN.
           DISPLAY ">>>> NOUS SOMMES PREMIERNIVEAUDOWN"
           PERFORM DEUXIEMENIVEAUSDOWN
           DISPLAY ">>>> RETOUR --> PREMIERNIVEAUDOWN".

       TROISIEMENIVEAUSDOWN.
           DISPLAY ">>>>>>>>>>>> NOUS SOMMES TROISIEMENIVEAUSDOWN".