       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PERFORMFORMAT3.
       AUTHOR.  AMN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITERCOMPTER         PIC 99  VALUE ZEROS.
          88 MAXCOMPTERATTEINT  VALUE 99.
       01 USERENTREE           PIC 99  VALUE ZEROS.
          88 ENDOFUSERENTREE   VALUE ZEROS.
       01 RUNNINGTOTAL        PIC 999 VALUE ZEROS.
       01 AVERAGEVALUE        PIC 99  VALUES ZEROS.

       PROCEDURE DIVISION.
       BEGIN.
           PERFORM UNTIL ITERCOMPTER = 5
              DISPLAY "ITERCOMPTER = " ITERCOMPTER
              ADD 1 TO ITERCOMPTER
           END-PERFORM
           DISPLAY "FIN DE LA LIGNE PERFORM."

           INITIALIZE ITERCOMPTER

           DISPLAY "ENTER A STREAM OF UP TO 99 NUMEROS."
           DISPLAY "CHAQUE NUMERO DOIT ETRE DANS LA PERIMETRE 1-99."
                    " ENTER 0 TO STOP."
           DISPLAY "ENTER NUMERO :- " WITH NO ADVANCING
           ACCEPT USERENTREE
           PERFORM GETUSERENTREE UNTIL ENDOFUSERENTREE
               OR MAXCOMPTERATTEINT

           DISPLAY "TOTAL FINAL EST - " RUNNINGTOTAL
           DISPLAY "COMPTEUR FINAL EST - " ITERCOMPTER
           COMPUTE AVERAGEVALUE = RUNNINGTOTAL / ITERCOMPTER
           DISPLAY "LA VALEUR MOYENNE EST - " AVERAGEVALUE
           STOP RUN.


       GETUSERENTREE.
           ADD USERENTREE TO RUNNINGTOTAL
               ON SIZE ERROR
               DISPLAY "ERREUR - GRANDE POUR L'ELEMENT DE DONNEES."
               NOT ON SIZE ERROR ADD 1 TO ITERCOMPTER END-ADD
           END-ADD
           DISPLAY "TOTAL JUSQU ICI EST - " RUNNINGTOTAL
           DISPLAY "COMPTER JUSQU ICI EST - " ITERCOMPTER
           DISPLAY "ENTER NUMERO :- " WITH NO ADVANCING
           ACCEPT USERENTREE.
